sergz72/ARM/atsamd11/atsamd11lib/component/pm.h
/* -------- PM_APBAMASK : (PM Offset: 0x18) (R/W 32) APBA Mask -------- */
#define PM_APBAMASK_RESETVALUE                _UINT32_(0x7F)                                       /*  (PM_APBAMASK) APBA Mask  Reset Value */

#define PM_APBAMASK_PAC0_Pos                  _UINT32_(0)                                          /* (PM_APBAMASK) PAC0 APB Clock Enable Position */
#define PM_APBAMASK_PAC0_Msk                  (_UINT32_(0x1) << PM_APBAMASK_PAC0_Pos)              /* (PM_APBAMASK) PAC0 APB Clock Enable Mask */
#define PM_APBAMASK_PAC0(value)               (PM_APBAMASK_PAC0_Msk & (_UINT32_(value) << PM_APBAMASK_PAC0_Pos)) /* Assigment of value for PAC0 in the PM_APBAMASK register */
#define PM_APBAMASK_PM_Pos                    _UINT32_(1)                                          /* (PM_APBAMASK) PM APB Clock Enable Position */
#define PM_APBAMASK_PM_Msk                    (_UINT32_(0x1) << PM_APBAMASK_PM_Pos)                /* (PM_APBAMASK) PM APB Clock Enable Mask */
#define PM_APBAMASK_PM(value)                 (PM_APBAMASK_PM_Msk & (_UINT32_(value) << PM_APBAMASK_PM_Pos)) /* Assigment of value for PM in the PM_APBAMASK register */
#define PM_APBAMASK_SYSCTRL_Pos               _UINT32_(2)                                          /* (PM_APBAMASK) SYSCTRL APB Clock Enable Position */
#define PM_APBAMASK_SYSCTRL_Msk               (_UINT32_(0x1) << PM_APBAMASK_SYSCTRL_Pos)           /* (PM_APBAMASK) SYSCTRL APB Clock Enable Mask */
#define PM_APBAMASK_SYSCTRL(value)            (PM_APBAMASK_SYSCTRL_Msk & (_UINT32_(value) << PM_APBAMASK_SYSCTRL_Pos)) /* Assigment of value for SYSCTRL in the PM_APBAMASK register */
#define PM_APBAMASK_GCLK_Pos                  _UINT32_(3)                                          /* (PM_APBAMASK) GCLK APB Clock Enable Position */
#define PM_APBAMASK_GCLK_Msk                  (_UINT32_(0x1) << PM_APBAMASK_GCLK_Pos)              /* (PM_APBAMASK) GCLK APB Clock Enable Mask */
#define PM_APBAMASK_GCLK(value)               (PM_APBAMASK_GCLK_Msk & (_UINT32_(value) << PM_APBAMASK_GCLK_Pos)) /* Assigment of value for GCLK in the PM_APBAMASK register */
#define PM_APBAMASK_WDT_Pos                   _UINT32_(4)                                          /* (PM_APBAMASK) WDT APB Clock Enable Position */
#define PM_APBAMASK_WDT_Msk                   (_UINT32_(0x1) << PM_APBAMASK_WDT_Pos)               /* (PM_APBAMASK) WDT APB Clock Enable Mask */
#define PM_APBAMASK_WDT(value)                (PM_APBAMASK_WDT_Msk & (_UINT32_(value) << PM_APBAMASK_WDT_Pos)) /* Assigment of value for WDT in the PM_APBAMASK register */
#define PM_APBAMASK_RTC_Pos                   _UINT32_(5)                                          /* (PM_APBAMASK) RTC APB Clock Enable Position */
#define PM_APBAMASK_RTC_Msk                   (_UINT32_(0x1) << PM_APBAMASK_RTC_Pos)               /* (PM_APBAMASK) RTC APB Clock Enable Mask */
#define PM_APBAMASK_RTC(value)                (PM_APBAMASK_RTC_Msk & (_UINT32_(value) << PM_APBAMASK_RTC_Pos)) /* Assigment of value for RTC in the PM_APBAMASK register */
#define PM_APBAMASK_EIC_Pos                   _UINT32_(6)                                          /* (PM_APBAMASK) EIC APB Clock Enable Position */
#define PM_APBAMASK_EIC_Msk                   (_UINT32_(0x1) << PM_APBAMASK_EIC_Pos)               /* (PM_APBAMASK) EIC APB Clock Enable Mask */
#define PM_APBAMASK_EIC(value)                (PM_APBAMASK_EIC_Msk & (_UINT32_(value) << PM_APBAMASK_EIC_Pos)) /* Assigment of value for EIC in the PM_APBAMASK register */
#define PM_APBAMASK_Msk                       _UINT32_(0x0000007F)                                 /* (PM_APBAMASK) Register Mask  */

#define PM_APBAMASK_PAC_Pos                   _UINT32_(0)                                          /* (PM_APBAMASK Position) PACx APB Clock Enable */
#define PM_APBAMASK_PAC_Msk                   (_UINT32_(0x1) << PM_APBAMASK_PAC_Pos)               /* (PM_APBAMASK Mask) PAC */
#define PM_APBAMASK_PAC(value)                (PM_APBAMASK_PAC_Msk & (_UINT32_(value) << PM_APBAMASK_PAC_Pos)) 

/* -------- PM_APBBMASK : (PM Offset: 0x1C) (R/W 32) APBB Mask -------- */
#define PM_APBBMASK_RESETVALUE                _UINT32_(0x7F)                                       /*  (PM_APBBMASK) APBB Mask  Reset Value */

#define PM_APBBMASK_PAC1_Pos                  _UINT32_(0)                                          /* (PM_APBBMASK) PAC1 APB Clock Enable Position */
#define PM_APBBMASK_PAC1_Msk                  (_UINT32_(0x1) << PM_APBBMASK_PAC1_Pos)              /* (PM_APBBMASK) PAC1 APB Clock Enable Mask */
#define PM_APBBMASK_PAC1(value)               (PM_APBBMASK_PAC1_Msk & (_UINT32_(value) << PM_APBBMASK_PAC1_Pos)) /* Assigment of value for PAC1 in the PM_APBBMASK register */
#define PM_APBBMASK_DSU_Pos                   _UINT32_(1)                                          /* (PM_APBBMASK) DSU APB Clock Enable Position */
#define PM_APBBMASK_DSU_Msk                   (_UINT32_(0x1) << PM_APBBMASK_DSU_Pos)               /* (PM_APBBMASK) DSU APB Clock Enable Mask */
#define PM_APBBMASK_DSU(value)                (PM_APBBMASK_DSU_Msk & (_UINT32_(value) << PM_APBBMASK_DSU_Pos)) /* Assigment of value for DSU in the PM_APBBMASK register */
#define PM_APBBMASK_NVMCTRL_Pos               _UINT32_(2)                                          /* (PM_APBBMASK) NVMCTRL APB Clock Enable Position */
#define PM_APBBMASK_NVMCTRL_Msk               (_UINT32_(0x1) << PM_APBBMASK_NVMCTRL_Pos)           /* (PM_APBBMASK) NVMCTRL APB Clock Enable Mask */
#define PM_APBBMASK_NVMCTRL(value)            (PM_APBBMASK_NVMCTRL_Msk & (_UINT32_(value) << PM_APBBMASK_NVMCTRL_Pos)) /* Assigment of value for NVMCTRL in the PM_APBBMASK register */
#define PM_APBBMASK_PORT_Pos                  _UINT32_(3)                                          /* (PM_APBBMASK) PORT APB Clock Enable Position */
#define PM_APBBMASK_PORT_Msk                  (_UINT32_(0x1) << PM_APBBMASK_PORT_Pos)              /* (PM_APBBMASK) PORT APB Clock Enable Mask */
#define PM_APBBMASK_PORT(value)               (PM_APBBMASK_PORT_Msk & (_UINT32_(value) << PM_APBBMASK_PORT_Pos)) /* Assigment of value for PORT in the PM_APBBMASK register */
#define PM_APBBMASK_DMAC_Pos                  _UINT32_(4)                                          /* (PM_APBBMASK) DMAC APB Clock Enable Position */
#define PM_APBBMASK_DMAC_Msk                  (_UINT32_(0x1) << PM_APBBMASK_DMAC_Pos)              /* (PM_APBBMASK) DMAC APB Clock Enable Mask */
#define PM_APBBMASK_DMAC(value)               (PM_APBBMASK_DMAC_Msk & (_UINT32_(value) << PM_APBBMASK_DMAC_Pos)) /* Assigment of value for DMAC in the PM_APBBMASK register */
#define PM_APBBMASK_USB_Pos                   _UINT32_(5)                                          /* (PM_APBBMASK) USB APB Clock Enable Position */
#define PM_APBBMASK_USB_Msk                   (_UINT32_(0x1) << PM_APBBMASK_USB_Pos)               /* (PM_APBBMASK) USB APB Clock Enable Mask */
#define PM_APBBMASK_USB(value)                (PM_APBBMASK_USB_Msk & (_UINT32_(value) << PM_APBBMASK_USB_Pos)) /* Assigment of value for USB in the PM_APBBMASK register */
#define PM_APBBMASK_HMATRIX_Pos               _UINT32_(6)                                          /* (PM_APBBMASK) HMATRIX APB Clock Enable Position */
#define PM_APBBMASK_HMATRIX_Msk               (_UINT32_(0x1) << PM_APBBMASK_HMATRIX_Pos)           /* (PM_APBBMASK) HMATRIX APB Clock Enable Mask */
#define PM_APBBMASK_HMATRIX(value)            (PM_APBBMASK_HMATRIX_Msk & (_UINT32_(value) << PM_APBBMASK_HMATRIX_Pos)) /* Assigment of value for HMATRIX in the PM_APBBMASK register */
#define PM_APBBMASK_Msk                       _UINT32_(0x0000007F)                                 /* (PM_APBBMASK) Register Mask  */

#define PM_APBBMASK_PAC_Pos                   _UINT32_(0)                                          /* (PM_APBBMASK Position) PACx APB Clock Enable */
#define PM_APBBMASK_PAC_Msk                   (_UINT32_(0x1) << PM_APBBMASK_PAC_Pos)               /* (PM_APBBMASK Mask) PAC */
#define PM_APBBMASK_PAC(value)                (PM_APBBMASK_PAC_Msk & (_UINT32_(value) << PM_APBBMASK_PAC_Pos)) 

/* -------- PM_APBCMASK : (PM Offset: 0x20) (R/W 32) APBC Mask -------- */
#define PM_APBCMASK_RESETVALUE                _UINT32_(0x100)                                      /*  (PM_APBCMASK) APBC Mask  Reset Value */

#define PM_APBCMASK_PAC2_Pos                  _UINT32_(0)                                          /* (PM_APBCMASK) PAC2 APB Clock Enable Position */
#define PM_APBCMASK_PAC2_Msk                  (_UINT32_(0x1) << PM_APBCMASK_PAC2_Pos)              /* (PM_APBCMASK) PAC2 APB Clock Enable Mask */
#define PM_APBCMASK_PAC2(value)               (PM_APBCMASK_PAC2_Msk & (_UINT32_(value) << PM_APBCMASK_PAC2_Pos)) /* Assigment of value for PAC2 in the PM_APBCMASK register */
#define PM_APBCMASK_EVSYS_Pos                 _UINT32_(1)                                          /* (PM_APBCMASK) EVSYS APB Clock Enable Position */
#define PM_APBCMASK_EVSYS_Msk                 (_UINT32_(0x1) << PM_APBCMASK_EVSYS_Pos)             /* (PM_APBCMASK) EVSYS APB Clock Enable Mask */
#define PM_APBCMASK_EVSYS(value)              (PM_APBCMASK_EVSYS_Msk & (_UINT32_(value) << PM_APBCMASK_EVSYS_Pos)) /* Assigment of value for EVSYS in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM0_Pos               _UINT32_(2)                                          /* (PM_APBCMASK) SERCOM0 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM0_Msk               (_UINT32_(0x1) << PM_APBCMASK_SERCOM0_Pos)           /* (PM_APBCMASK) SERCOM0 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM0(value)            (PM_APBCMASK_SERCOM0_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM0_Pos)) /* Assigment of value for SERCOM0 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM1_Pos               _UINT32_(3)                                          /* (PM_APBCMASK) SERCOM1 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM1_Msk               (_UINT32_(0x1) << PM_APBCMASK_SERCOM1_Pos)           /* (PM_APBCMASK) SERCOM1 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM1(value)            (PM_APBCMASK_SERCOM1_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM1_Pos)) /* Assigment of value for SERCOM1 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM2_Pos               _UINT32_(4)                                          /* (PM_APBCMASK) SERCOM2 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM2_Msk               (_UINT32_(0x1) << PM_APBCMASK_SERCOM2_Pos)           /* (PM_APBCMASK) SERCOM2 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM2(value)            (PM_APBCMASK_SERCOM2_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM2_Pos)) /* Assigment of value for SERCOM2 in the PM_APBCMASK register */
#define PM_APBCMASK_TCC0_Pos                  _UINT32_(5)                                          /* (PM_APBCMASK) TCC0 APB Clock Enable Position */
#define PM_APBCMASK_TCC0_Msk                  (_UINT32_(0x1) << PM_APBCMASK_TCC0_Pos)              /* (PM_APBCMASK) TCC0 APB Clock Enable Mask */
#define PM_APBCMASK_TCC0(value)               (PM_APBCMASK_TCC0_Msk & (_UINT32_(value) << PM_APBCMASK_TCC0_Pos)) /* Assigment of value for TCC0 in the PM_APBCMASK register */
#define PM_APBCMASK_TC1_Pos                   _UINT32_(6)                                          /* (PM_APBCMASK) TC1 APB Clock Enable Position */
#define PM_APBCMASK_TC1_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC1_Pos)               /* (PM_APBCMASK) TC1 APB Clock Enable Mask */
#define PM_APBCMASK_TC1(value)                (PM_APBCMASK_TC1_Msk & (_UINT32_(value) << PM_APBCMASK_TC1_Pos)) /* Assigment of value for TC1 in the PM_APBCMASK register */
#define PM_APBCMASK_TC2_Pos                   _UINT32_(7)                                          /* (PM_APBCMASK) TC2 APB Clock Enable Position */
#define PM_APBCMASK_TC2_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC2_Pos)               /* (PM_APBCMASK) TC2 APB Clock Enable Mask */
#define PM_APBCMASK_TC2(value)                (PM_APBCMASK_TC2_Msk & (_UINT32_(value) << PM_APBCMASK_TC2_Pos)) /* Assigment of value for TC2 in the PM_APBCMASK register */
#define PM_APBCMASK_ADC_Pos                   _UINT32_(8)                                          /* (PM_APBCMASK) ADC APB Clock Enable Position */
#define PM_APBCMASK_ADC_Msk                   (_UINT32_(0x1) << PM_APBCMASK_ADC_Pos)               /* (PM_APBCMASK) ADC APB Clock Enable Mask */
#define PM_APBCMASK_ADC(value)                (PM_APBCMASK_ADC_Msk & (_UINT32_(value) << PM_APBCMASK_ADC_Pos)) /* Assigment of value for ADC in the PM_APBCMASK register */
#define PM_APBCMASK_AC_Pos                    _UINT32_(9)                                          /* (PM_APBCMASK) AC APB Clock Enable Position */
#define PM_APBCMASK_AC_Msk                    (_UINT32_(0x1) << PM_APBCMASK_AC_Pos)                /* (PM_APBCMASK) AC APB Clock Enable Mask */
#define PM_APBCMASK_AC(value)                 (PM_APBCMASK_AC_Msk & (_UINT32_(value) << PM_APBCMASK_AC_Pos)) /* Assigment of value for AC in the PM_APBCMASK register */
#define PM_APBCMASK_DAC_Pos                   _UINT32_(10)                                         /* (PM_APBCMASK) DAC APB Clock Enable Position */
#define PM_APBCMASK_DAC_Msk                   (_UINT32_(0x1) << PM_APBCMASK_DAC_Pos)               /* (PM_APBCMASK) DAC APB Clock Enable Mask */
#define PM_APBCMASK_DAC(value)                (PM_APBCMASK_DAC_Msk & (_UINT32_(value) << PM_APBCMASK_DAC_Pos)) /* Assigment of value for DAC in the PM_APBCMASK register */
#define PM_APBCMASK_PTC_Pos                   _UINT32_(11)                                         /* (PM_APBCMASK) PTC APB Clock Enable Position */
#define PM_APBCMASK_PTC_Msk                   (_UINT32_(0x1) << PM_APBCMASK_PTC_Pos)               /* (PM_APBCMASK) PTC APB Clock Enable Mask */
#define PM_APBCMASK_PTC(value)                (PM_APBCMASK_PTC_Msk & (_UINT32_(value) << PM_APBCMASK_PTC_Pos)) /* Assigment of value for PTC in the PM_APBCMASK register */
#define PM_APBCMASK_Msk                       _UINT32_(0x00000FFF)                                 /* (PM_APBCMASK) Register Mask  */

#define PM_APBCMASK_PAC_Pos                   _UINT32_(0)                                          /* (PM_APBCMASK Position) PAC2 APB Clock Enable */
#define PM_APBCMASK_PAC_Msk                   (_UINT32_(0x1) << PM_APBCMASK_PAC_Pos)               /* (PM_APBCMASK Mask) PAC */
#define PM_APBCMASK_PAC(value)                (PM_APBCMASK_PAC_Msk & (_UINT32_(value) << PM_APBCMASK_PAC_Pos)) 
#define PM_APBCMASK_SERCOM_Pos                _UINT32_(2)                                          /* (PM_APBCMASK Position) SERCOMx APB Clock Enable */
#define PM_APBCMASK_SERCOM_Msk                (_UINT32_(0x7) << PM_APBCMASK_SERCOM_Pos)            /* (PM_APBCMASK Mask) SERCOM */
#define PM_APBCMASK_SERCOM(value)             (PM_APBCMASK_SERCOM_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM_Pos)) 
#define PM_APBCMASK_TCC_Pos                   _UINT32_(5)                                          /* (PM_APBCMASK Position) TCCx APB Clock Enable */
#define PM_APBCMASK_TCC_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TCC_Pos)               /* (PM_APBCMASK Mask) TCC */
#define PM_APBCMASK_TCC(value)                (PM_APBCMASK_TCC_Msk & (_UINT32_(value) << PM_APBCMASK_TCC_Pos)) 
#define PM_APBCMASK_TC_Pos                    _UINT32_(6)                                          /* (PM_APBCMASK Position) TCx APB Clock Enable */
#define PM_APBCMASK_TC_Msk                    (_UINT32_(0x3) << PM_APBCMASK_TC_Pos)                /* (PM_APBCMASK Mask) TC */
#define PM_APBCMASK_TC(value)                 (PM_APBCMASK_TC_Msk & (_UINT32_(value) << PM_APBCMASK_TC_Pos)) 

/* -------- PM_INTENCLR : (PM Offset: 0x34) (R/W 8) Interrupt Enable Clear -------- */
#define PM_INTENCLR_RESETVALUE                _UINT8_(0x00)                                        /*  (PM_INTENCLR) Interrupt Enable Clear  Reset Value */

#define PM_INTENCLR_CKRDY_Pos                 _UINT8_(0)                                           /* (PM_INTENCLR) Clock Ready Interrupt Enable Position */
#define PM_INTENCLR_CKRDY_Msk                 (_UINT8_(0x1) << PM_INTENCLR_CKRDY_Pos)              /* (PM_INTENCLR) Clock Ready Interrupt Enable Mask */
#define PM_INTENCLR_CKRDY(value)              (PM_INTENCLR_CKRDY_Msk & (_UINT8_(value) << PM_INTENCLR_CKRDY_Pos)) /* Assigment of value for CKRDY in the PM_INTENCLR register */
#define PM_INTENCLR_CFD_Pos                   _UINT8_(1)                                           /* (PM_INTENCLR) Clock Failure Detector Interrupt Enable Position */
#define PM_INTENCLR_CFD_Msk                   (_UINT8_(0x1) << PM_INTENCLR_CFD_Pos)                /* (PM_INTENCLR) Clock Failure Detector Interrupt Enable Mask */
#define PM_INTENCLR_CFD(value)                (PM_INTENCLR_CFD_Msk & (_UINT8_(value) << PM_INTENCLR_CFD_Pos)) /* Assigment of value for CFD in the PM_INTENCLR register */
#define PM_INTENCLR_Msk                       _UINT8_(0x03)                                        /* (PM_INTENCLR) Register Mask  */


/* -------- PM_INTENSET : (PM Offset: 0x35) (R/W 8) Interrupt Enable Set -------- */
#define PM_INTENSET_RESETVALUE                _UINT8_(0x00)                                        /*  (PM_INTENSET) Interrupt Enable Set  Reset Value */

